{
    "menu-index": "← Index",
    "menu-about": "About Me",
    "menu-skills": "Skills", 
    "menu-projects": "Projects",
    "menu-contact": "Contact",
    "main-heading": "Aspiring developer in human languages and AI at the service of users",
    "about-me": "Who am I",
    "about-me-description": "My name is Hugo, and I am an aspiring AI developer currently refining my skills at Bordeaux University's IUT. Passionate about combining artificial intelligence with human languages, I am actively building a strong foundation in computer science, constantly learning and applying new technologies to shape my future career as an AI professional.",
    "skills-heading": "Skills",
    "skill-database": "Database",
    "database-relational": "Relational: design relational databases by creating MCD, MLD, and MPD, and writing optimised SQL queries.",
    "database-object": "Object: work with object-oriented databases, mapping objects to schemas and handling complex data structures.",
    "database-sgbd": "SGBD: SQL Server, MySQL, Oracle",
    "skill-project-management": "Project management",
    "project-management-clean-code": "Clean code: write concise, well-documented code and apply validation techniques.",
    "project-management-v-model": "V-project management: follow V-model steps to ensure structured development and efficient testing.",
    "project-management-agile": "Agile methods (SCRUM): collaborate effectively in iterative sprints to deliver value progressively.",
    "project-management-tools": "Software engineering tools (AGL): Win'design",
    "skill-deployment-tools": "Software deployment tools",
    "deployment-github-actions": "Github Actions: prepare workflows for efficient deployment automation and integration.",
    "deployment-gitlab": "Gitlab: manage repositories with clear versioning, detailed README files, and collaborative branching strategies.",
    "skill-frameworks": "Frameworks",
    "framework-bootstrap": "Bootstrap: create responsive websites quickly and efficiently.",
    "framework-symfony": "Symfony: use for structured development and secure database interactions.",
    "skill-ci-cd": "Continuous integration / CICD",
    "ci-cd-formal-methods": "Formal methods: apply formal verification techniques to ensure software consistency.",
    "ci-cd-quality": "Software quality: use best practices to maintain high code quality through continuous integration and regular reviews.",
    "ci-cd-testing": "Testing: fundamentals and automation.",
    "skill-modeling": "Modeling languages and methods",
    "modeling-entity-diagram": "Entity association diagram: design clear entity relationships to visualize and validate project structure before development.",
    "modeling-uml": "UML: model complex systems to represent class inheritance, abstraction, polymorphism, and user interaction scenarios (scnenarii).",
    "skill-programming-languages": "Programming languages",
    "programming-system": "System: C, C#",
    "programming-object-oriented": "Object-oriented: C#, Java",
    "programming-web-dev": "Web development: HTML/CSS, Java, PHP, JavaScript",
    "programming-scripting": "Scripting/Automation: Bash, PHP",
    "skill-development-tools": "Development tools",
    "skill-oop": "Object-oriented programming",
    "oop-principles": "Programming and design paradigms: apply key OOP principles (inheritance, encapsulation, polymorphism, abstraction) to design efficient, reusable code.",
    "oop-mvc": "MVC architecture: use Model-View-Controller pattern to separate data, user interface, and control logic for better project organization.",
    "oop-design-patterns": "Design patterns: implement common design patterns (like Singleton, Factory, Observer) to solve recurring design problems.",
    "skill-networks": "Networks",
    "network-protocols": "Definition and use of protocols: configure and manage DNS, DHCP protocols.",
    "network-http": "HTTP/HTTPS: understand and implement HTTP and HTTPS requests and responses.",
    "network-routing": "Routing: TCP/IP",
    "network-osi": "OSI Model: apply to analyze and design network communcation layers.",
    "skill-operating-systems": "Operating systems",
    "skill-testing": "Tests/Test methods",
    "testing-junit": "JUnit: write and run unit tests for Java applications.",
    "testing-methodology": "Test set design methodology: develop clear and structured test scenarios.",
    "testing-static-analysis": "Static analysis and proofs: verify program correctness using format methods.",
    "projects-heading": "Projects",
    "toggle-filters": "Show Filters",
    "filter-ai": "AI",
    "filter-web": "Web", 
    "filter-networks": "Networks",
    "filter-games": "Games",
    "filter-data": "Data Science",
    "filter-devops": "DevOps",
    "filter-cloud": "Cloud",
    "project-japanese-conjugator-title": "Japanese Conjugator",
    "project-japanese-conjugator-description": "This was my first project, combining two passions: Japanese and JavaScript programming. I created the Japanese Conjugator Website to help others and myself in my japanese conjugation studies. This experience helped me explore open-source GitHub projects, get familiar with their documentation, and integrate external libraries into my work.",
    "project-labyrinth-update-title": "Labyrinth Update",
    "project-labyrinth-update-description": "Using the JavaFX library (i.e. in Java), I implemented the game, its rules and graphics. The principle is simple: it's a classic labyrinth game in which the aim is to reach the exit while avoiding the enemies lurking between the floors. My main objective in this project was to learn how to differentiate between the concrete part of the code, and its graphic part (sprites).",
    "project-anhydralgo-title": "Anhydralgo",
    "project-anhydralgo-description": "My very first team project under real conditions, both in terms of deliverables and meeting deadlines. I have been the coordinator to ensure agreement and synchronization of the progress of tasks, while ensuring the implementation of automated statistical graphics generation.",
    "project-network-installation-title": "Network Installation Tutorial",
    "project-network-installation-description": "This project was divided into two parts: first, to install a network and then write a tutorial on how to use it. For the installation, I chose with my binôme to deploy its use through the office suite NextCloud offering a wide variety of tools to the user. I have done some of the configuration of these tools. For the writing of the tutorial, this one describes how to reproduce the steps of the installation we have conducted. I mainly wrote the English version of the tutorial.",
    "project-graffiting-streets-title": "Graffiting The Streets",
    "project-graffiting-streets-description": "This project consists of creating the front side of a website by applying an appropriate interface. I have created personas (main, secondary and anti-personas) in order to effectively target the type of visitors that my site should accommodate. I also adapted this site to the respect of Responsive Design development.",
    "project-towa-ai-title": "Towa AI",
    "project-towa-ai-description": "My very first experience of applying an AI in a hands-on immersive simulation is in this project. In a competitive context, I developed a min-max AI adapted to the trend of play and strategies of other players' AI.",
    "contact-heading": "Contact",
    "contact-intro": "Feel free to reach out to me via the following channels:",
    "contact-email": "Email",
    "contact-linkedin": "LinkedIn",
    "contact-github": "GitHub",
    "contact-phone": "Phone",
    "contact-outro": "Looking forward to connecting with you!",
    "footer-copyright": "© 2024 Retail Hugo"
}