{
    "menu-index": "← Index",
    "menu-about": "À propos de moi",
    "menu-skills": "Compétences",
    "menu-projects": "Projets",
    "menu-contact": "Contact",
    "main-heading": "Développeur en devenir dans les langues humaines et IA",
    "about-me": "Qui suis-je",
    "about-me-description":"Je m'appelle Hugo, et je cherche à devenir un développeur en IA, tout en étudiant à l'IUT Informatique de Bordeaux. Je suis passionné par la combination de l'intelligence artificelle avec les langages humains. Je cherche toujours à développer une large culture de l'informatique, en apprenant et en appliquant constamment de nouvelles technologies pour construire ma future carrière en tant que professionnel de l'intelligence artificielle.",
    "skills-heading": "Compétences",
    "skill-database": "Base de données",
    "database-relational": "Relationnel : concevoir des bases de données relationnelles en créant des MCD, MLD et MPD, et en rédigeant des requêtes SQL optimisées.",
    "database-object": "Objet : travailler avec des bases de données orientées objets, en mappant les objets sur des schémas et en manipulant des structures de données complexes.",
    "database-sgbd": "SGBD : SQL Server, MySQL, Oracle",
    "skill-project-management": "Gestion de projet",
    "project-management-clean-code": "Code propre : rédiger un code concis et bien documenté, et appliquer des techniques de validation.",
    "project-management-v-model": "Modèle en V : suivre les étapes du modèle en V pour assurer un développement structuré et des tests efficaces.",
    "project-management-agile": "Méthodes Agile (SCRUM) : collaborer efficacement dans des sprints itératifs pour livrer progressivement de la valeur.",
    "project-management-tools": "Outils d'ingénierie logicielle (AGL) : Win'design",
    "skill-deployment-tools": "Outils de déploiement logiciel",
    "deployment-github-actions": "Github Actions : préparer des workflows pour une automatisation et une intégration optimisée du déploiement.",
    "deployment-gitlab": "Gitlab : gérer des dépôts avec du versionning, des fichiers README détaillés et des stratégies de branchement collaboratif.",
    "skill-frameworks": "Frameworks",
    "framework-bootstrap": "Bootstrap : créer des sites web responsives rapidement et efficacement.",
    "framework-symfony": "Symfony : utiliser pour un développement structuré et des interactions sécurisées avec les bases de données.",
    "skill-ci-cd": "Intégration continue / CICD",
    "ci-cd-formal-methods": "Méthodes formelles : appliquer des techniques de vérification formelle pour assurer la cohérence du logiciel.",
    "ci-cd-quality": "Qualité du logiciel : utiliser de meilleures pratiques pour maintenir une bonne qualité de code grâce à l'intégration continue et des révisions régulières.",
    "ci-cd-testing": "Tests : fondamentaux et automatisation.",
    "skill-modeling": "Langages et méthodes de modélisation",
    "modeling-entity-diagram": "Diagramme d'entité-association : concevoir des relations d'entités claires pour visualiser et valider la structure d'un projet avant son développement.",
    "modeling-uml": "UML : modéliser des systèmes complexes pour représenter l'héritage des classes, l'abstraction, le polymorphisme et les scénarii.",
    "skill-programming-languages": "Langages de programmation",
    "programming-system": "Système : C, C#",
    "programming-object-oriented": "Orienté objet : C#, Java",
    "programming-web-dev": "Développement web : HTML/CSS, Java, PHP, JavaScript",
    "programming-scripting": "Scripting/Automatisation : Bash, PHP",
    "skill-development-tools": "Outils de développement",
    "skill-oop": "Programmation orientée objet",
    "oop-principles": "Paradigmes de programmation et de conception : appliquer les principes clés de la POO (héritage, encapsulation, polymorphisme, abstraction) pour concevoir un code efficace et réutilisable.",
    "oop-mvc": "Architecture MVC : utiliser le modèle-vue-contrôleur pour séparer les données, l'interface utilisateur et la logique de contrôle pour une meilleure organisation du projet.",
    "oop-design-patterns": "Design patterns : mettre en œuvre des patterns de conception courants (comme Singleton, Factory, Observer) pour résoudre des problèmes de conception récurrents.",
    "skill-networks": "Réseaux",
    "network-protocols": "Définition et utilisation des protocoles : configurer et gérer les protocoles DNS, DHCP.",
    "network-http": "HTTP/HTTPS : comprendre et implémenter des requêtes et réponses HTTP et HTTPS.",
    "network-routing": "Routage : TCP/IP",
    "network-osi": "Modèle OSI : appliquer pour analyser et concevoir les couches de communication réseau.",
    "skill-operating-systems": "Systèmes d'exploitation",
    "skill-testing": "Tests/Méthodes de test",
    "testing-junit": "JUnit : écrire et exécuter des tests unitaires pour des applications Java.",
    "testing-methodology": "Méthodologie de conception de jeux de tests : développer des scénarios de tests clairs et structurés.",
    "testing-static-analysis": "Analyse statique et preuves : vérifier la correction des programmes à l'aide de méthodes formelles.",
    "projects-heading": "Projets",
    "toggle-filters": "Afficher les filtres",
    "filter-ai": "IA",
    "filter-web": "Web",
    "filter-networks": "Réseaux",
    "filter-games": "Jeux",
    "filter-data": "Data Science",
    "filter-devops": "DevOps",
    "filter-cloud": "Cloud",
    "project-japanese-conjugator-title": "Japanese Conjugator",
    "project-japanese-conjugator-description": "Il s'agit de mon premier projet combinant deux passions : Le japonais et la programmation JavaScript. J'ai créé ce site pour aider les autres et moi-même dans mes études de conjugaison japonaise. Cette expérience m'a permis d'explorer des projets open-source sur GitHub, de me familiariser avec leur documentation et d'intégrer des bibliothèques externes dans mon travail.",
    "project-labyrinth-update-title": "Mise à jour: Jeu de Labyrinthe",
    "project-labyrinth-update-description": "En utilisant la bibliothèque JavaFX (c'est-à-dire en Java), j'ai implémenté le jeu, ses règles et ses graphismes. Le principe est simple : il s'agit d'un jeu de labyrinthe classique dans lequel le but est d'atteindre la sortie tout en évitant les ennemis qui se cachent entre les étages. Mon objectif principal dans ce projet était d'apprendre à différencier la partie concrète du code, et sa partie graphique (sprites).",
    "project-anhydralgo-title": "Anhydralgo",
    "project-anhydralgo-description": "Mon tout premier projet en équipe dans des conditions réelles, tant en termes de livrables que de respect des délais. J'ai été le coordinateur pour assurer l'accord et la synchronisation de l'avancement des tâches, tout en assurant la mise en œuvre de la génération automatisée de graphiques statistiques.",
    "project-network-installation-title": "Tutoriel d'installation d'un réseau",
    "project-network-installation-description": "Ce projet a été divisé en deux parties : tout d'abord, l'installation d'un réseau et ensuite la rédaction d'un tutoriel sur son utilisation. Pour l'installation, j'ai choisi avec mon binôme de déployer son utilisation à travers la suite bureautique NextCloud offrant une grande variété d'outils à l'utilisateur. J'ai réalisé une partie de la configuration de ces outils. Pour la rédaction du tutoriel, celui-ci décrit comment reproduire les étapes de l'installation que nous avons menée. J'ai principalement rédigé la version anglaise du tutoriel.",
    "project-graffiting-streets-title": "Graffiting The Streets",
    "project-graffiting-streets-description": "Ce projet consiste à créer le front-end d'un site web en appliquant une interface appropriée. J'ai créé des personas (principal, secondaire et anti-personas) afin de cibler efficacement le type de visiteurs que mon site doit accueillir. J'ai également adapté ce site au respect d'un développement Responsive.",
    "project-towa-ai-title": "Towa IA",
    "project-towa-ai-description": "Ce projet constitue ma toute première expérience d'application d'une IA dans une simulation immersive pratique. Dans un contexte compétitif, j'ai développé une IA min-max adaptée à la tendance de jeu et aux stratégies des IA des autres joueurs.",
    "contact-heading": "Contact",
    "contact-intro": "N'hésitez pas à me contacter avec les ressources suivantes :",
    "contact-email": "Email",
    "contact-linkedin": "LinkedIn",
    "contact-github": "GitHub",
    "contact-phone": "Téléphone",
    "contact-outro": "Au plaisir d'entrer en contact avec vous !",
    "footer-copyright": "© 2024 Retail Hugo"
}
